bench_results/20251212_174828/__status_t8_c100.txt
Running 15s test @ http://127.0.0.1:8080/_/status
  8 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   410.71ms   22.22ms 599.30ms   92.28%
    Req/Sec    37.85     29.41   111.00     71.67%
  Latency Distribution
     50%  408.70ms
     75%  411.18ms
     90%  416.81ms
     99%  458.38ms
  3470 requests in 15.06s, 31.18MB read
Requests/sec:    230.43
Transfer/sec:      2.07MB